\chapter{Testing}
\section{Network Infrastructure Testing}
Testing of the router configurations was be implemented by viewing the routing
information of the running network. For the testing of this lab network we
opted to test both the routes distributed in normal operation and the fail-over
behaviour of the network should link failure occur. These tests were
implemented from both an IGP and EGP perspective.

Testing of the IGP protocol IS-IS was implemented through observing the route
taken by traffic between routers in both normal operation and when the link
being used was removed. Such a scenario gave an indication as to how resilient
the interior network was to device failure, as can be seen in
Listing~\ref{listing:isis-testing}. In this test, we first checked connectivity
to Charlie and the route taken to this location via GigabitEthernet0/0. We then
removed the link from Bravo to Charlie, forcing the IS-IS process to find an
alternate route. As can be seen in the figure, the time taken for IS-IS
convergence was enough to drop two ICMP Ping packets. However after these
timeouts the topology converged and provided a route which is one hop further,
allowing the final three Ping packets to reach their destination. As can be
seen from the final traceroute the new route now goes via Alpha to reach
Charlie.

\begin{lstlisting}[caption={Testing of IS-IS reaction to link failure}, label={listing:isis-testing}]
Bravo#ping 12.3.3.3
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 12.3.3.3, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/4 ms

Bravo#traceroute 12.3.3.3
Type escape sequence to abort.
Tracing the route to charlie.group2.lboro (12.3.3.3)
VRF info: (vrf in name/id, vrf out name/id)
1 12.0.0.6 4 msec *  0 msec

Bravo#sh ip int brief
Interface                  IP-Address      OK? Method Status                Protocol
...
GigabitEthernet0/0         12.0.0.5        YES NVRAM  up                    up
...

Bravo#sh ip int brief
Interface                  IP-Address      OK? Method Status                Protocol
...
GigabitEthernet0/0         12.0.0.5        YES NVRAM  down                  down
...

Bravo#ping 12.3.3.3
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 12.3.3.3, timeout is 2 seconds:
..!!!
Success rate is 60 percent (3/5), round-trip min/avg/max = 1/1/1 ms

Bravo#traceroute 12.3.3.3
Type escape sequence to abort.
Tracing the route to charlie.group2.lboro (12.3.3.3)
VRF info: (vrf in name/id, vrf out name/id)
1 12.0.0.1 4 msec 0 msec 0 msec
2 12.0.0.9 4 msec *  0 msec
\end{lstlisting}

Testing the EGP configuration was implemented by checking that prefixes we
received from our peers were expected and correct, in addition to this we also
tested that iBGP received the external prefixes with the correct next-hop
address. Listing~\ref{listing:bgp-table} shows a condensed version of the BGP
Prefix Table found on Alpha. It can be seen that there were redundant routes to
some networks, in particular one peer \texttt{8.0.0.0/8} could be seen via our
BGP peer and via our provider, AS 42.

\begin{lstlisting}[caption={Extract of Alpha BGP Table}, label={listing:bgp-table}]
Alpha#sh ip bgp
BGP table version is 377, local router ID is 12.1.1.1

Network          Next Hop            Metric LocPrf Weight Path
*   8.0.0.0/28       10.1.1.1                               0 42 5607 i
*>i                  12.2.2.2                 0    100      0 5607 i
*   8.0.0.16/28      10.1.1.1                               0 42 5607 i
*>i                  12.2.2.2                 0    100      0 5607 i
*   8.0.0.32/28      10.1.1.1                               0 42 5607 i
*>i                  12.2.2.2                20    100      0 5607 i
*   8.0.0.48/28      10.1.1.1                               0 42 5607 i
*>i                  12.2.2.2                20    100      0 5607 i
*   8.0.0.64/28      10.1.1.1                               0 42 5607 i
*>i                  12.2.2.2                20    100      0 5607 i
*>i 8.0.0.80/28      12.2.2.2                 0    100      0 5607 i
*                    10.1.1.1                               0 42 5607 i
r>  10.1.1.1/32      10.1.1.1                 0             0 42 i
*>  10.2.2.0/24      10.1.1.1                 0             0 42 i
* i 12.0.1.0/24      12.3.3.3                20    100      0 i
* i                  12.2.2.2                20    100      0 i
*>                   0.0.0.0                  0         32768 i
* i 12.0.2.0/24      12.3.3.3                20    100      0 i
*>                   12.0.0.2                20         32768 i
* i                  12.2.2.2                 0    100      0 i
* i 12.0.3.0/24      12.3.3.3                 0    100      0 i
* i                  12.2.2.2                20    100      0 i
*>                   12.0.0.9                20         32768 i
* i 12.1.1.1/32      12.3.3.3                20    100      0 i
* i                  12.2.2.2                20    100      0 i
*>                   0.0.0.0                  0         32768 i
* i 12.2.2.2/32      12.3.3.3                20    100      0 i
* i                  12.2.2.2                 0    100      0 i
*>                   12.0.0.2                20         32768 i
* i 12.3.3.3/32      12.3.3.3                 0    100      0 i
* i                  12.2.2.2                20    100      0 i
*>                   12.0.0.9                20         32768 i
*>i 34.0.0.0/28      12.3.3.3                 0    100      0 2792 i
*>i 34.0.0.16/28     12.3.3.3                10    100      0 2792 i
*>i 34.0.0.64/28     12.3.3.3                 0    100      0 2792 i
*>i 34.0.0.80/28     12.3.3.3                20    100      0 2792 i
*>  56.0.0.0/30      10.1.1.1                               0 42 5607 6871 ?
*>  56.0.0.4/30      10.1.1.1                               0 42 2497 6871 ?
* i 78.0.0.0/28      12.3.3.3                 0    100      0 2792 5089 i
*>                   10.1.1.1                               0 42 5089 i
*>i 78.0.0.16/28     12.3.3.3                 0    100      0 2792 5089 i
*                    10.1.1.1                               0 42 2497 5089 i
* i 78.0.0.32/28     12.3.3.3                 0    100      0 2792 5089 i
*>                   10.1.1.1                               0 42 5089 i
*>  112.0.0.16/28    10.1.1.1                               0 42 97 i
*>  112.0.0.32/28    10.1.1.1                               0 42 97 i
*>  121.0.0.0/24     10.1.1.1                               0 42 2497 i
*>  121.0.1.0/24     10.1.1.1                               0 42 2497 i
\end{lstlisting}

A shortened version on the Bravo BGP Prefix Table is shown in
Listing~\ref{listing:bravo-bgp-table}, this contains a network
\texttt{56.0.0.0/30} as an example of an external network which has an updated
next-hop. Bravo would send any traffic directed to the \texttt{56.0.0.0/30}
network to \texttt{10.1.1.1} which would then forward the traffic to AS 42.

\begin{lstlisting}[caption={Extract of Bravo BGP Table}, label={listing:bravo-bgp-table}]
Bravo#sh ip bgp summary
BGP table version is 267, local router ID is 12.2.2.2

Network          Next Hop            Metric LocPrf Weight Path
...
*>i 56.0.0.0/30      12.1.1.1                 0    100      0 42 5607 6871 ?
...
\end{lstlisting}

One feature our BT's routing policy was providing a back-up link to each of our
Peer's providers, in both cases this was AS 42 (\texttt{10.0.0.0/8}). To
provide this redundancy without allowing our network to be exploited we
employed policy to restrict the distribution of prefixes between our peers. Our
configuration restricted advertisements AS 5607 and AS 2792 to only include
(\texttt{12.0.0.0/8}) and (\texttt{10.0.0.0/8}) advertisements.
Listing~\ref{listing:bravo-advert-table} shows the prefixes that were being
advertised to AS 5607. Without any policy all known BGP routes would be sent to
our peers, however the Listing shows that these additional routes were
retracted from advertisements.

\begin{lstlisting}[caption={Prefixes advertised to AS 5607}, label={listing:bravo-advert-table}]
Bravo#sh ip bgp neighbors 12.11.0.2 advertised-routes
BGP table version is 267, local router ID is 12.2.2.2

Network          Next Hop            Metric LocPrf Weight Path
*>i 10.1.1.1/32      12.1.1.1                 0    100      0 42 i
*>i 10.2.2.0/24      12.1.1.1                 0    100      0 42 i
*>  12.0.1.0/24      12.0.0.1                20         32768 i
*>  12.0.2.0/24      0.0.0.0                  0         32768 i
*>  12.0.3.0/24      12.0.0.6                20         32768 i
*>  12.1.1.1/32      12.0.0.1                20         32768 i
*>  12.2.2.2/32      0.0.0.0                  0         32768 i
*>  12.3.3.3/32      12.0.0.6                20         32768 i

Total number of prefixes 8
\end{lstlisting}

In addition to the management of prefixes sent to our peers, we also tested
that we can still connect to peers should our link go down.
Listing~\ref{listing:bgp-failover} shows the best prefix information for the
route \texttt{34.0.0.64} first under normal conditions, then after the peer
link was taken down and finally when the link was restored. It can be seen that
BGP coped with this link failure by using the link via our provider rather than
the peer link for connections.

\begin{lstlisting}[caption={Failover of connection to AS 2792}, label={listing:bgp-failover}]
Bravo#sh ip bgp 34.0.0.64
BGP routing table entry for 34.0.0.64/28, version 255
Paths: (1 available, best #1, table default)
Not advertised to any peer
Refresh Epoch 1
2792
12.3.3.3 (metric 20) from 12.3.3.3 (12.3.3.3)
Origin IGP, metric 0, localpref 100, valid, internal, best

Bravo#sh ip bgp 34.0.0.64
BGP routing table entry for 34.0.0.64/28, version 276
Paths: (1 available, best #1, table default, not advertised to EBGP peer)
Flag: 0x820
Not advertised to any peer
Refresh Epoch 2
42 2497 5089 2792
12.1.1.1 (metric 20) from 12.1.1.1 (12.1.1.1)
Origin IGP, metric 0, localpref 100, valid, internal, best
Community: no-export

Bravo#sh ip bgp 34.0.0.64
BGP routing table entry for 34.0.0.64/28, version 280
Paths: (1 available, best #1, table default)
Flag: 0x820
Not advertised to any peer
Refresh Epoch 1
2792
12.3.3.3 (metric 20) from 12.3.3.3 (12.3.3.3)
Origin IGP, metric 0, localpref 100, valid, internal, best
\end{lstlisting}

\section{Service Testing}
The only service that featured redundancy was the DNS servers. Listing~\ref
{listing:dns-testing} shows the result of the same DNS query made before and
then after the master DNS server was disconnected. As can be seen, the first
query was answered by the \texttt{12.0.1.2} master server, whereas the second
query was answered by \texttt{12.0.2.2}, the designated slave server.

\begin{lstlisting}[caption={Testing of DNS response to server disconnection}, label={listing:dns-testing}]
group2@laptop-3:~$ nslookup alpha.group2.lboro
Server:     12.0.1.2
Address:    12.0.1.2#53

Name:   alpha.group2.lboro
Address: 12.1.1.1

group2@laptop-3:~$ nslookup alpha.group2.lboro
Server:     12.0.2.2
Address:    12.0.2.2#53

Name:   alpha.group2.lboro
Address: 12.1.1.1
\end{lstlisting}
